# 配置命令

## 1.静态路由的配置

```
路由器配置部分：
R1
Router>en  //进入特权模式
Router#conf t  //进入全局模式
R1-01(config)#ho  R1-01  //修改hostname，可选
R1-01(config)#in f0/0      //进入路由器1的f0/0接口，设置Router to PC1接口的IP地址
R1-01(config-if)#ip ad 192.168.1.1 255.255.255.0  //为当前f0/0接口配置IP地址
R1-01(config-if)#no sh   //启动该端口的路由功能，激活端口
R1-01(config-if)#exit  //退出当前接口
R1-01(config)#in f0/1    //进入f0/1接口
R1-01(config-if)#ip ad 192.168.2.1 255.255.255.0  //设置f0/1接口的IP地址
R1-01(config-if)#no sh   //启动该端口路由功能
R1-01(config-if)#end  //回到特权模式
R1-01#sh ru   //查看各接口配置信息（此行命令可不做）

R2
Router>en
Router#conf t
Router(config)ho R2-01
R2-01(config)#in f0/0 
R2-01(config-if)#ip ad 192.168.2.2 255.255.255.0
R2-01(config-if)#no sh 
R2-01(config-if)#exit 
R2-01(config)#in f0/1
R2-01(config-if)#ip ad 192.168.3.1 255.255.255.0  
R2-01(config-if)#no sh 
R2-01(config-if)#exit 
R2-01#sh ru 

R3
Router>en
Router#conf t
Router(config)ho  R3-01
R3-01(config)#in f0/0
R3-01(config-if)#ip ad 192.168.3.2 255.255.255.0
R3-01(config-if)#no sh
R3-01(config-if)#exit
R3-01(config)#in f0/1
R3-01(config-if)#ip ad 192.168.4.1 255.255.255.0
R3-01(config-if)#no sh
R3-01(config-if)#exit
R3-01#sh ru

静态路由配置部分：
R1
Router>en    //进入特权模式
Router#conf t  //进入全局配置模式
Router(config)#ip route 0.0.0.0 0.0.0.0 192.168.2.2   //为R1路由器增加一条静态路由，命令格式为ip route + 目的网络地址 目的网络掩码 下一跳ip，其中0.0.0.0可代表任意一个ip 
Router(config)#end	  //返回特权模式
Router# sh ip ro  //使用show命令查看当前路由器的路由表

R2
Router>en  
Router#conf t 
Router(config)#ip route 192.168.1.0 255.255.255.0 192.168.2.1 
Router(config)#ip route 192.168.4.0 255.255.255.0 192.168.3.2
Router(config)#end
Router#sh ip ro

R3
Router>en    
Router#conf t
Router(config)#ip route 0.0.0.0 0.0.0.0 192.168.3.1    
Router(config)#end
Router#sh ip ro
```

## 2.RIP动态路由配置

```
R1 IP配置
Router>en  //进入特权模式
Router#conf t  //进入全局配置模式
Router(config)ho  R1-01  //修改路由器名字与学号关联
R1-01(config)#inter fa 0/0  //进入路由器R1的f0/0接口
R1-01(config-if)#ip ad 192.168.1.1 255.255.255.0 //为f0/0接口配置IP地址和对应掩码
R1-01(config-if)#no sh  //启动该端口的路由功能，激活端口
R1-01(config-if)#exit  //退出当前端口
R1-01(config)#inter f 0/1  //进入路由器R1的f0/1接口
R1-01(config-if)#ip ad 10.0.0.1 255.0.0.0  //为f0/1接口配置IP地址和对应掩码
R1-01(config-if)#no sh  //启动该端口的路由功能，激活端口
R1-01(config-if)#end  //返回特权模式
R1-01#sh ru  //查看当前路由器各接口IP配置（此行选做）

R2 IP配置
Router>en  //进入特权模式
Router#conf t  //进入全局配置模式
Router(config)ho  R2-01  //修改路由器名字与学号关联
R2-01(config)#inter fa0/0  //进入路由器R1的f0/0接口
R2-01(config-if)#ip address 10.0.0.2 255.0.0.0  //为f0/0配置ip和掩码
R2-01(config-if)#no sh    //启动激活当前端口
R2-01(config-if)#exit   //退出当前接口
R2-01(config)#in f0/1  //进入路由器R1的f0/1接口
R2-01(config-if)#ip address 20.0.0.1 255.0.0.0  //为f0/1配置ip和掩码
R2-01(config-if)#no sh  //启动激活当前端口
R2-01(config-if)#end  //返回特权模式
R2-01#sh ru  //查看IP配置

R3 IP配置（注释同上）
Router>en
Router#conf t
Router(config)ho  R3-01  //修改路由器名字与学号关联
R3-01(config)#inter fa 0/0  
R3-01(config-if)#ip ad 20.0.0.2 255.0.0.0
R3-01(config-if)#no shutdown
R3-01(config-if)#exit
R3-01(config)#inter f 0/1
R3-01(config-if)#ip ad 192.168.2.1 255.255.255.0
R3-01(config-if)#no sh
R3-01(config-if)#end
R3-01#sh ru  //查看IP配置

R1 路由配置
R1-01#conf t
R1-01(config)#router rip  //开启Router RIP协议
R1-01(config-router)#network 192.168.1.0  //向RIP添加IP地址，公布路由器1的直连网络ip
R1-01(config-router)#network 10.0.0.0   //向RIP添加IP地址，公布路由器1的直连网络ip
R1-01(config-router)#version 2     //使用RIPv2版本的RIP协议
R1-01(config-router)#end   //返回特权模式
R1-01#sh ip ro   //查看当前路由器的路由表（此行选做）

R2 路由配置
R2-01#conf t  //开启Router RIP协议
R2-01(config)#router rip
R2-01(config-router)#network 10.0.0.0  //向RIP添加IP地址，公布路由器2的直连网络ip
R2-01(config-router)#network 20.0.0.0  //向RIP添加IP地址，公布路由器2的直连网络ip
R2-01(config-router)#version 2  //使用RIPv2版本的RIP协议
R2-01(config-router)#end   //返回特权模式

R3 路由配置（注释同上）
R3-01#conf t
R3-01(config)#router rip  //开启Router RIP协议
R3-01(config-router)# #network 20.0.0.0  
R3-01(config-router) network 192.168.2.0
R3-01(config-router)#version 2     //使用RIPv2版本的RIP
R3-01(config-router)#show ip ro
```

## 3.OSPF动态路由配置

```
R1 IP配置
Router>en   //进入特权模式
Router#conf t  //进入全局配置模式
Router(config)ho  R1-01  //修改路由器名字与学号关联
R1-01(config)#in f 0/0  //进入f0/0接口
R1-01(config-if)#ip ad 192.168.1.1 255.255.255.0 //为当前接口配置ip地址
R1-01(config-if)#no sh  //启用接口路由功能，激活当前接口
R1-01(config-if)#exit   //退出当前接口
R1-01(config)#in f0/1   //进入f0/1接口
R1-01(config-if)#ip ad 192.168.2.1 255.255.255.0  //为当前接口配置ip地址
R1-01(config-if)#no sh   //启用接口路由功能，激活当前接口
R1-01(config-if)#end   //返回特权模式
R1-01#sh ru  //查看IP配置（选做）

R2 IP配置（注释同上）
Router>en 
Router#conf t
Router(config)ho  R2-01
R2-01(config)#in f0/0
R2-01(config-if)#ip ad 192.168.2.2 255.255.255.0
R2-01(config-if)#no sh 
R2-01(config-if)#exit
R2-01(config)#in f0/1
R2-01(config-if)#ip address 192.168.3.1 255.255.255.0
R2-01(config-if)#no sh 
R2-01(config-if)#end
R2-01#sh ru  //查看IP配置

R3 IP配置（注释同上）
Router#en
Router#conf t
Router(config)ho  R3-01
R3-01(config)#in f0/0
R3-01(config-if)#ip ad 192.168.3.2 255.255.255.0
R3-01(config-if)# no sh 
R3-01(config-if)#exit
R3-01(config)#in f0/1
R3-01(config-if)#ip ad 192.168.4.1 255.255.255.0
R3-01(config-if)#no sh 
R3-01(config-if)#end
R3-01#sh ru  //查看IP配置

R1 路由配置
R1-01r#conf t  //进入全局模式
R1-01r(config)#router ospf 100 //为路由器写入ospf（其中100表示进程号，所有配置了ospf协议的路由器都在此进程内通信）
R1-01(config-router)#network 192.168.1.0 0.0.0.255 area 1  //公布当前路由器的直连网络，命令格式为 network+直连网络ip所在的网络号+直连网络通配符掩码（子网掩码的反码+直连网络所属的区域）
R1-01(config-router)#network 192.168.2.0 0.0.0.255 area 0  公布当前路由器的另一个直连网络，命令格式为 network+直连网络ip所在的网络号+直连网络通配符掩码（子网掩码的反码+直连网络所属的区域）
R1-01(config-router)#end  //返回特权模式
R1-01#sh ip ro  //查看当前路由器的路由表（选做）

R2 路由配置（注释同上）
R2-01#conf t  //进入全局模式
R2-01(config)#router ospf 100 
R2-01(config-router)#network 192.168.2.0 0.0.0.255 area 0
R2-01(config-router)#network 192.168.3.0 0.0.0.255 area 0
R2-01(config-router)#end
R2-01#sh ip ro
R2-01#wr

R3 路由配置（注释同上）
R3-01(config)#router ospf 100 
R3-01(config-router)#network 192.168.3.0 0.0.0.255 area 0
R3-01(config-router)#network 193.168.4.0 0.0.0.255 area 2
R3-01(config-router)#end
R3-01#sh ip ro
R3-01#wr
```

## 4.Vlan与Trunk实验

```
Switch1配置命令：
Switch>enable          //进入特权模式
Switch#vlan database    //进入vlan数据库
Switch(vlan)#vlan 2     //新建vlan2
Switch(vlan)#vlan 3     //新建vlan3
Switch(vlan)#exit       //退出vlan数据库
Switch#config terminal  //进入全局配置模式
Switch#ho S1-01
S1-01(config)#interface f0/2   //进入接口0/2
S1-01(config-if)#sw mo ac
S1-01(config-if)#switchport access vlan 2   //将access模式的0/2端口划入vlan2
S1-01(config)#interface f0/3   //进入接口0/3
S1-01(config-if)#sw mo ac
S1-01(config-if)#switchport access vlan 3  //将access模式的0/3端口划入vlan3
S1-01(config)#interface f0/24 //进入接口0/24
S1-01(config-if)#switchport  mode  trunk //将0/24端口配置为trunk模式
# 检查(可选)
S1-01(config-if)#exit
S1-01(config)#exit
# 查看 vlan
S1-01#show vlan brief
# 查看接口状态
S1-01#show interfaces status

Switch2配置命令（注释同上）：
Switch>enable
Switch#vlan database
Switch(vlan)#vlan 2
Switch(vlan)#vlan 3
Switch(vlan)#exit
Switch#config terminal
Switch(config)#ho S2-01
S2-01(config)#interface f0/2
S2-01(config-if)#sw mo ac
S2-01(config-if)#switchport access vlan 2
S2-01(config)#interface f0/3
S2-01(config-if)#sw mo ac
S2-01(config-if)#switchport access vlan 3
S2-01(config)#interface f0/24
S2-01(config-if)#switchport  mode  trunk
```

## 5.单臂路由vlan互通

```
Switch1配置
Switch>en  //进入特权模式
Switch#conf t  //进入全局模式
Switch(config)#ho S1-01  //修改交换机名字
S1-01(config)#vl 10  //创建vl10
S1-01(config-vlan)#exit  //退出vlan 数据库
S1-01(config)#vl 20  //创建vl 20
S1-01(config-vlan)exit  //退出vlan数据库
S1-01(config)in f0/1  //进入交换机的f0/1接口
S1-01(config-if)sw mo ac  //将f0/1接口切换为access模式
S1-01(config-if)sw ac vl 10  //将f0/1接口加入vl 10 
S1-01(config-if)exit  //退出f0/1接口
S1-01(config)in  f0/2  //进入交换机f0/2接口
S1-01(config-if)sw mo ac  //将f0/2接口切换为access模式
S1-01(config-if)sw ac vl 20  //将f0/2接口加入vl 20
S1-01(config-if)#end  //回到特权模式
S1-01#sh vl  //使用sh vl br命令查看vlan信息
S1-01#conf t  //进入全局模式
S1-01(config)in f0/3    //进入交换机f0/3接口
S1-01(config-if)sw mo tr 	//设置端口的模式为trunk模式
S1-01(config-if)end //返回特权模式
S1-01# sh ru  //查看各接口配置信息（此行选做）

Router0
Router>en
Router#conf t
Router(config)#ho R0-01
R0-01(config)#in f0/0  //进入路由器0模块第0端口
R0-01(config-if)#no sh  //激活开启该端口(此时路由连接交换机的端口从block转到forward)
R0-01(config-if)#exit	//退出当前接口
R0-01(config)#in f 0/0.1  //进入路由器0模块第0端口第1子接口
R0-01(config-subif)#encapsulation dot1Q 10  //封装协议设置为dot1q 允许通过的vlan 为10
R0-01(config-subif)#ip ad 192.168.1.1 255.255.255.0  //为该子接口配置IP地址为192.168.1.1
R0-01(config-subif)#exit	//退出当前接口
R0-01(config)#in f0/0.2    //创建并进入路由器0模块第0端口第2子接口
R0-01(config-subif)#encapsulation dot1q 20//封装协议设置为dot1q 允许通过的vlan 为20
R0-01(config-subif)#ip ad 192.168.2.1 255.255.255.0 //该子接口配置IP地址为192.168.2.1
R0-01(config-subif)#end  //返回特权模式
R0-01#sh ip ro   //查看当前路由器的路由表
```

## 6. 多端口路由配置

```
交换机配置：
Switch>en  //进入特权模式
Switch#vl da  //进入vlan数据库
Switch(vlan)#vl 2  //新建vlan2
Switch(vlan)#vl 3  //新建vlan3
Switch(vlan)#vl 4  //新建vlan4
Switch(vlan)#exit  //退出当前vlan数据库
Switch#conf t    //进入全局模式
Switch(config)#ho S1-01  //修改交换机名字
S1-01(config)#in ra f0/1-3  //批量配置命令in range，批量配置1-3三个接口
S1-01(config-if-range)#sw mo ac
S1-01(config-if-range)#sw ac vl 2  //将1-3三个接口加入vlan 2
S1-01(config-if-range)#exit  //退出当前三个接口
S1-01(config)#in ra f0/4-6  //批量配置4-6三个接口
S1-01(config-if-range)#sw mo ac
S1-01(config-if-range)#sw ac vl 3  //将4-6三个接口加入vlan 3
S1-01(config-if-range)#exit  //退出4-6三个接口
S1-01(config)#in ra f0/7-9  //批量配置7-9三个接口
S1-01(config-if-range)#sw mo ac
S1-01(config-if-range)#sw ac vl 4  //将7-9三个接口加入vlan4
S1-01(config-if-range)#end  //退回特权模式
S1-01#sh vl   //查看vlan配置信息（选做）

路由器配置：
Router>en   //进入特权模式
Router#conf t   //进入全局配置模式
Router(config)#ho R1-01  //修改路由器名字
R1-01(config)#in g0/0  //进入2911型号路由器千兆0/0接口
R1-01(config-if)#ip ad 192.168.1.254 255.255.255.0  //为该接口配置ip和掩码
R1-01(config-if)#no sh  //激活该接口
R1-01(config-if)#exit  //退出该接口
R1-01(config)#in g0/1  //进入2911型号路由器千兆0/1接口
R1-01(config-if)#ip ad 192.168.2.254 255.255.255.0  //为该接口配置ip和掩码
R1-01(config-if)#no sh  //激活该接口
R1-01(config-if)#exit  //退出该接口
R1-01(config)#in g0/2  //进入2911型号路由器千兆0/2接口
R1-01(config-if)#ip ad 192.168.3.254 255.255.255.0  //激活该接口
R1-01(config-if)#no sh  //退出该接口
R1-01(config-if)#end  //退回特权模式
R1-01#sh ip ro   //查看当前路由器路由表（选做）
```

## 7.三层交换机的配置（一）

```
三层交换机S1配置：
Switch>en
Switch#conf t
S1(config)ho S1  //交换机更名
S1(config)#vl 2  //创建VLAN
S1(config-vlan)#vl 3  //创建VLAN3
S1(config-vlan)#vl 6  //创建VLAN6
S1(config-vlan)#exit  //退出VLAN数据库
S1(config)#in r f0/1-2  //批量配置接口1-2
S1(config-if-range)#sw mo ac
S1(config-if-range)#sw ac vl 2  //将1-2接口加入vlan 2
S1(config-if-range)#exit //退出1-2接口
S1(config)#in r f0/3-4  //批量配置接口3-4
S1(config-if-range)#sw mo ac
S1(config-if-range)#sw ac vl 3  //将3-4接口加入vlan 3
S1(config-if-range)#exit  //退出3-4接口
S1(config)#in f0/5  //进入接口5
S1(config-if)#sw mo ac
S1(config-if)#sw ac vl 6  //将接口5加入VLAN6
S1(config-if)#end  //返回特权模式
S1#sh vl  //查看Vlan配置信息（选做）
S1(config)#in vl 2    //创建名为vl2的虚拟接口
S1(config-if)#ip ad 192.168.1.254 255.255.255.0  //为vl2虚拟接口配置对应IP地址（网关）和子网掩码
S1(config-if)#no sh
S1(config-if)#exit   //退出当前接口
S1(config)#in vl 3  //创建名为vl3的虚拟接口
S1(config-if)#ip ad 192.168.2.254 255.255.255.0  //为vl2虚拟接口配置对应IP地址和掩码
S1(config-if)#no sh
S1(config-if)#exit  //退出当前接口
S1(config)#in vl 6  //创建名为vl6的虚拟接口
S1(config-if)#ip ad 192.168.5.1 255.255.255.0  //为vl6虚拟接口配置对应IP地址和掩码
S1(config-if)#exit  //退出当前接口
S1(config)#ip routing  //启动三层交换机的路由功能
S1(config)#router rip  //RIP配置
S1(config-router)#network 192.168.1.0  //对外公布直连网络1
S1(config-router)#network 192.168.2.0  //对外公布直连网络2
S1(config-router)#network 192.168.5.0  //对外公布直连网络3
S1(config-router)#end
S1#sh ip ro  //查看路由配置表

三层交换机S2配置（注释同上）：
Switch>en
Switch#conf t
Switch(config)#ho S2//交换机更名
S2(config)#vl 4
S2(config-vlan)#vl 5
S2(config-vlan)#vl 6
S2(config-vlan)#exit
S2(config)#in r f0/1-2
S2(config-if-range)#sw mo ac
S2(config-if-range)#sw ac vl 4
S2(config-if-range)#exit
S2(config)#in r f0/3-4
S2(config-if-range)#sw mo ac
S2(config-if-range)#sw ac vl 5
S2(config-if-range)#exit
S2(config)#in f0/5
S2(config-if)#sw mo ac
S2(config-if)#sw ac vl 6
S2(config-if)#end
S2#sh vl

S2#conf t
S2(config)#in vl 4
S2(config-if)#ip ad 192.168.3.254 255.255.255.0
S2(config-if)#exit
S2(config)#in vl 5
S2(config-if)#ip ad 192.168.4.254 255.255.255.0
S2(config-if)#exit
S2(config)#in vl 6
S2(config-if)#ip ad 192.168.5.2 255.255.255.0
S2(config-if)#exit

S2(config)#ip routing
S2(config)#router rip
S2(config-router)#network 192.168.3.0
S2(config-router)#network 192.168.4.0
S2(config-router)#network 192.168.5.0
S2(config)#end
S2#sh ip ro
```

## 9. 端口聚合

实验报告不用交配置命令

```
SW1配置
Switch>en  //进入特权模式
Switch#vl da  //进入vlan数据库
Switch(vlan)#vl 10   //创建vl 10
Switch(vlan)#vl 20   //创建vl 20
Switch(vlan)#exit    //退出vlan数据库
Switch#conf t    //进入全局模式
Switch(config)#ho S1  //更改路由器名字（选做）
S1(config)#in f0/1  //进入f0/1接口
S1(config-if)#sw mo ac  //将此接口切换为access模式
S1(config-if)#sw ac vl 10  //将此接口加入vl 10
S1(config-if)#exit   //退出当前接口
S1(config)#in f0/2   //进入接口2
S1(config-if)#sw mo ac  //将此接口切换为access模式
S1(config-if)#sw ac vl 20  //将此接口加入vl 20
S1(config-if)#exit  退出当前接口
S1(config)#end  //返回特权模式
S1#sh vl    //查看vlan配置信息

S1#conf t  //进入全局模式
S1(config)#in ra g0/1-2  //批量进入1-2接口
S1(config-if-range)#channel-group 3 mode on //将1-2两个接口的性能聚合到一个组中（组编号为3，此处编号1-6随意指定），组模式为on模式（自适应模式）
S1(config-if-range)#exit
S1(config)#in port-channel 3  //进入编号为3的接口组中
S1(config-if)#sw mo tr  //将聚合后的接口组3切换为trunk模式
S1(config-if)#sw tr al vl 10,20  //让接口组3只转发vl10和vl20的数据
S1(config-if)#no sh  //激活该接口组3
S1(config-if)#end   //返回特权模式
S1#sh etherchannel summary  //查看创建好的接口组信息

SW2配置（注释同上）
Switch>
Switch>en
Switch#vl da
Switch(vlan)#vl 10
Switch(vlan)#vl 20
Switch(vlan)#exit
Switch#conf t
Switch(config)#ho S2
S2(config)#in f0/1
S2(config-if)#sw mo ac
S2(config-if)#sw ac vl 10
S2(config-if)#exit
S2(config)#in f0/2
S2(config-if)#sw mo ac
S2(config-if)#sw ac vl 20
S2(config-if)#exit
S2(config)#end
S2#sh vl

S2#conf t
S2(config)#in ra g0/1-2
S2(config-if-range)#channel-group 3 mode on
S2(config-if-range)#exit
S2(config)#in port-channel 3
S2(config-if)#sw mo tr
S2(config-if)#sw tr al vl 10,20
S2(config-if)#no sh
S2(config-if)#end
S2#sh ru
S2#sh etherchannel summary
```
